# Ввод значений
a1 = int(input())  # Левая граница первого отрезка
b1 = int(input())  # Правая граница первого отрезка
a2 = int(input())  # Левая граница второго отрезка
b2 = int(input())  # Правая граница второго отрезка

# Находим границы пересечения
left = max(a1, a2)  # Левая граница пересечения
right = min(b1, b2)  # Правая граница пересечения

# Проверяем наличие пересечения
if left < right:
    print(left, right)  # Выводим отрезок
elif left == right:
    print(left)  # Выводим точку
else:
    print("пустое множество")  # Пересечения нет
